# Исключения:
try:
	# код в ходе которого может быть поднято исключение
except EXCEPTION as e:
	# обработка ошибки

# Вызов ошибки: raise
# Пример:

class MyClass():
	def func(self, *args, **kwargs):
		raise EXCEPTION("error message")
# В python все исключения - это экземпляры классов, которые наследуются от BaseException
#Правила наследования:

#1. В `except` указывается класс - ловятся _он сам и все его подклассы_, но не его суперклассы. То есть `except Exception` поймает `KeyError`, но не поймает `KeyboardInterrupt`;
#2. Два класса исключений, которые не связаны наследованием, никогда не эквивалентны, даже если у них одинаковое имя;
#3. `BaseException` - корень всего дерева, но он _не предназначен_ для прямого наследования пользовательскими классами (для этого есть `Exception`);
#4. Все пользовательские исключения должны наследоваться от `Exception` или одного из его подклассов;
#5. Наследоваться лучше от _одного_ типа исключения за раз: встроенные классы реализованы на C и имеют свою memory layout, поэтому множественное наследование может конфликтовать из-за обработки `args` и раскладки в памяти.

# JSON'ы
# один из основных удобных способов хранения данных в python. Модуль для работы с этим типов уже есть в python.

#1. Файл всегда начинается с `{}` - это корневой элемент;
#2. По сути json - это большой словарь;
#3. `{}` - словарь, `[]` - список;
#4. "Ключ": значение;
#5. При переходе на новую строку ставится запятая;
#6. Всегда только один корневой элемент в json;

# Преобразования json -> py

#| JSON          | Python |
#| ------------- | ------ |
#| object        | dict   |
#| array         | list   |
#| string        | str    |
#| number (int)  | int    |
#| number (real) | float  |
#| true          | True   |
#| false         | False  |
#| null          | None   |


# Работа с json

#|`dumps`|строка|Кодирует объект python -> JSON строку|`str`|
#|`dump`|файл|Кодирует объект python -> JSON в файл|`None`|
#|`loads`|строка|Декодирует JSON строку -> объект python|объект python|
#|`load`|файл|Декодирует JSON из файла -> объект python|объект python|